<?php

return [
    'error' => <<<TEXT
خطا:
:error
TEXT,
    'greeting' => <<<TEXT
سلام دوست من! 😍👋

به ربات انشانویس خوش اومدی! 📝✨

اینجا می‌تونی برای موضوع‌های مختلف، انشاهای قشنگ و خلاقانه بنویسی و کلی ایده‌ی جدید پیدا کنی. کافیه موضوع انشات رو بهم بگی تا با هم شروع کنیم! 😎📚

خب، بریم یه انشای خوب بنویسیم؟ 😁

برای شروع، روی دکمه <b>درخواست انشاء</b> کلیک کن! 👇🏻
TEXT,
    'operation-canceled' => 'عملیات لغو شد.',
    'the-message-type-is-not-supported' => "{1} این نوع پیام پشتیبانی نشده است!\nپیام باید از نوع :required_one_of_fields باشد. |[2,*] این نوع پیام پشتیبانی نشده است!\nپیام باید یکی از انواع زیر باشد:\n:required_one_of_fields",
    'it-is-not-possible-to-save-protected-content' => 'امکان ذخیره کردن محتوای حفاظت شده وجود ندارد.',
    'message-saved-stop-process-by-save-and-finish-or-continue-saving' => 'پیام شما با موفقیت ذخیره شد. هر زمان که خواستید می‌توانید با ارسال عبارت «ذخیره و پایان» فرایند را متوقف کنید. در غیر این صورت، می‌توانید پیام‌های بیشتری ارسال کنید تا آن‌ها را نیز ذخیره کنم.',
    'send-the-messages-you-wish-to-be-sent-as-notifications' => 'لطفاً پیام‌هایی را که مایل به ارسال آن‌ها به عنوان اعلان هستید، ارسال کنید.',
    'notification-queued-for-delivery-do-not-delete-messages-until-delivery-completes' => <<<TEXT
اعلان در صف ارسال قرار گرفت.

لطفاً تا پایان فرایند ارسال، پیام‌های مربوط به این اعلان را حذف نکنید؛ در غیر این صورت، فرایند ارسال با خطا مواجه خواهد شد.

شناسه: :id
TEXT,
    'do-you-want-the-message-to-be-quoted' => 'آیا می‌خواهید پیام نقل قول شود؟',
];
